Excel file reading

In [15]:
import pandas as pd

In [16]:
df=pd.read_excel("students.xlsx")
df

             Name  Maths  Science  Engilsh
0       Akash rai     45       50       34
1     shyam kumar     99       78       23
2    ronish yadav     56       34       32
3  prakash sakhya     67       50       90

In [17]:
df["total"]=df["Maths"]+df["Science"]+df["Engilsh"]
df["average"]=df["total"]//3

In [18]:
df

             Name  Maths  Science  Engilsh  total  average
0       Akash rai     45       50       34    129       43
1     shyam kumar     99       78       23    200       66
2    ronish yadav     56       34       32    122       40
3  prakash sakhya     67       50       90    207       69

In [19]:
df["result"]=df["average"].apply(
    lambda x: "passed" if x>=60 else "failed"
)

In [20]:
df

             Name  Maths  Science  Engilsh  total  average  result
0       Akash rai     45       50       34    129       43  failed
1     shyam kumar     99       78       23    200       66  passed
2    ronish yadav     56       34       32    122       40  failed
3  prakash sakhya     67       50       90    207       69  passed

In [21]:
df.to_excel("student_result.xlsx",index=False)

In [22]:
df

             Name  Maths  Science  Engilsh  total  average  result
0       Akash rai     45       50       34    129       43  failed
1     shyam kumar     99       78       23    200       66  passed
2    ronish yadav     56       34       32    122       40  failed
3  prakash sakhya     67       50       90    207       69  passed

Task

In [23]:
# create a table for books with fields:title,author,year
# insert 3 books and query by author.
# update a book's year
# delete a book

In [24]:
from sqlalchemy import create_engine
engine=create_engine('sqlite:///bookdb.db',echo=True)

In [25]:
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer,String

Base=declarative_base()
class Book(Base):
    __tablename__='Books'
    title=Column(String,primary_key=True)
    author=Column(String)
    year=Column(Integer)
#create the table
Base.metadata.create_all(engine)

2025-12-30 20:50:13,501 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-12-30 20:50:13,502 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("Books")
2025-12-30 20:50:13,503 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-12-30 20:50:13,504 INFO sqlalchemy.engine.Engine PRAGMA temp.table_info("Books")
2025-12-30 20:50:13,506 INFO sqlalchemy.engine.Engine [raw sql] ()
2025-12-30 20:50:13,507 INFO sqlalchemy.engine.Engine
CREATE TABLE "Books" (
	title VARCHAR NOT NULL,
	author VARCHAR,
	year INTEGER,
	PRIMARY KEY (title)
)


2025-12-30 20:50:13,508 INFO sqlalchemy.engine.Engine [no key 0.00060s] ()
2025-12-30 20:50:13,513 INFO sqlalchemy.engine.Engine COMMIT

C:\Users\tonys\AppData\Local\Temp\ipykernel_22752\1405186471.py:4: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base=declarative_base()

In [26]:
from sqlalchemy.orm import sessionmaker
Session=sessionmaker(bind=engine)
Session=Session()

In [27]:
book1=Book(title='reverend insanity',author='gu zen re',year=2000)
book2=Book(title='swallowed star',author='ieattomato',year=2010)
book3=Book(title='lotm',author='ieattomato',year=2001)
Session.add(book1)
Session.add(book2)
Session.add(book3)

In [28]:
# books=Session.query(Book).all()
books = Session.query(Book).filter_by(author='ieattomato').all()
for b in books:
    print(b.title,b.author,b.year)

2025-12-30 20:50:13,544 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2025-12-30 20:50:13,546 INFO sqlalchemy.engine.Engine INSERT INTO "Books" (title, author, year) VALUES (?, ?, ?)
2025-12-30 20:50:13,547 INFO sqlalchemy.engine.Engine [generated in 0.00127s] [('reverend insanity', 'gu zen re', 2000), ('swallowed star', 'ieattomato', 2010), ('lotm', 'ieattomato', 2001)]
2025-12-30 20:50:13,552 INFO sqlalchemy.engine.Engine SELECT "Books".title AS "Books_title", "Books".author AS "Books_author", "Books".year AS "Books_year"
FROM "Books"
WHERE "Books".author = ?
2025-12-30 20:50:13,553 INFO sqlalchemy.engine.Engine [generated in 0.00098s] ('ieattomato',)
swallowed star ieattomato 2010
lotm ieattomato 2001

In [31]:
books=Session.query(Book).filter_by(title='reverend insanity').first()
books.year=2065
# Session.commit()

2025-12-30 20:51:09,223 INFO sqlalchemy.engine.Engine UPDATE "Books" SET year=? WHERE "Books".title = ?
2025-12-30 20:51:09,225 INFO sqlalchemy.engine.Engine [generated in 0.00162s] (2065, 'reverend insanity')
2025-12-30 20:51:09,227 INFO sqlalchemy.engine.Engine SELECT "Books".title AS "Books_title", "Books".author AS "Books_author", "Books".year AS "Books_year"
FROM "Books"
WHERE "Books".title = ?
 LIMIT ? OFFSET ?
2025-12-30 20:51:09,228 INFO sqlalchemy.engine.Engine [generated in 0.00080s] ('reverend insanity', 1, 0)

In [32]:
book=Session.query(Book).filter_by(title='lotm').first()
Session.delete(book)

2025-12-30 20:52:23,878 INFO sqlalchemy.engine.Engine SELECT "Books".title AS "Books_title", "Books".author AS "Books_author", "Books".year AS "Books_year"
FROM "Books"
WHERE "Books".title = ?
 LIMIT ? OFFSET ?
2025-12-30 20:52:23,879 INFO sqlalchemy.engine.Engine [cached since 74.65s ago] ('lotm', 1, 0)

In [33]:
Session.commit()

2025-12-30 20:52:32,581 INFO sqlalchemy.engine.Engine DELETE FROM "Books" WHERE "Books".title = ?
2025-12-30 20:52:32,582 INFO sqlalchemy.engine.Engine [generated in 0.00118s] ('lotm',)
2025-12-30 20:52:32,589 INFO sqlalchemy.engine.Engine COMMIT